app/controllers/albums_controller.rb

SELECT * FROM `albums`
---
  def index
    @albums = Album.all

INSERT INTO `albums` (`updated_at`, `title`, `user_id`, `created_at`) VALUES('2009-03-02 13:27:30', 'pirat', NULL, '2009-03-02 13:27:30')
---
  def create
    @album = Album.new(params[:album])

    if @album.save

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
DELETE FROM `albums` WHERE `id` = 2
---
  def destroy
    @album = Album.find(params[:id])
    @album.destroy