app/controllers/photos_controller.rb

SELECT * FROM `photos` WHERE (`photos`.`parent_id` IS NULL) AND (`photos`.album_id = 6)
---
  def index
    @photos = @album.photos.all(:conditions => { :parent_id => nil })

INSERT INTO `photos` (`content_type`, `thumbnail`, `size`, `updated_at`, `title`, `album_id`, `filename`, `height`, `parent_id`, `with`, `created_at`) VALUES('image/jpeg', NULL, 30356, '2009-02-12 18:21:48', NULL, NULL, 'guypalfriend.jpg', 278, NULL, NULL, '2009-02-12 18:21:48')
---
  def create
    @photo = Photo.new(params[:photo])
    @photo.album = @album

    if @photo.save

SELECT * FROM `photos` WHERE (`photos`.`id` = 9)
---
  def show
    @photo = Photo.find(params[:id])

SELECT * FROM `photos` WHERE (`photos`.parent_id = 1)
DELETE FROM `photos` WHERE `id` = 2
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy

SELECT * FROM `albums` WHERE (`albums`.`id` = 4)
---
  def load_album
    @album = Album.find(params[:album_id])