app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `admin`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '524092523d0ec68b10e321123769005b1295fd9c', '2009-03-02 13:20:25', '344b02fbb8dd75ce810e6b0b2a30ec4b207eca4c', NULL, 0, NULL, 'mrbowmore', 'ebbagr@hotmail.com', '2009-03-02 13:20:25')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `hashed_password` = '9f546ec3b7f12a35c9116041c6b8cd07ff2c0b8f', `salt` = '268470800.371953719991934', `updated_at` = '2009-02-19 10:27:59' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])